app/controllers/contracts_controller.rb

SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 1 LIMIT 1
---
  def show
    @contract = Contract.find(params[:id])

SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 2 LIMIT 1
---
  def edit
    @contract = Contract.find(params[:id])

INSERT INTO `contracts` (`content`, `created_at`, `finishdate`, `name`, `signdate`, `startdate`, `status`, `updated_at`) VALUES ('测试', '2013-03-17 15:50:42', '2013-03-17', '测试', '2013-03-17', '2013-03-17', NULL, '2013-03-17 15:50:42')
---
  def create
    @contract = Contract.new(params[:contract])
    @contract.save_file(params[:attachment]) if params[:attachment]

SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 1 LIMIT 1
UPDATE `contracts` SET `status` = 2, `updated_at` = '2013-03-18 05:51:58' WHERE `contracts`.`id` = 1
---
  def update
    @contract = Contract.find(params[:id])

    respond_to do |format|
      if @contract.update_attributes(params[:contract])