app/controllers/equipment_controller.rb

  def show
    @equipment = Equipment.find(params[:id])
---
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1

  def edit
    @equipment = Equipment.find(params[:id])
---
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1

  def create
    @equipment = Equipment.new(params[:equipment])

    respond_to do |format|
      if @equipment.save
---
INSERT INTO `equipment` (`borrower`, `category`, `created_at`, `keeper`, `name`, `quantity`, `updated_at`, `usage`) VALUES ('解亚龙', '起重器', '2013-03-18 05:31:32', '牛宏睿', '起重机', 1, '2013-03-18 05:31:32', 1)