app/controllers/holes_controller.rb

  def index
    #@holes = Hole.all
	if(params[:holenumber])
      @holes = Hole.where("holenumber like ?", "%#{params[:holenumber]}%").paginate(:page=>params[:page],:per_page=>10)
	elsif params[:minearea]
      @holes = Hole.where("minearea like ?", "%#{params[:minearea]}%").paginate(:page=>params[:page],:per_page=>10)
	elsif params[:outerflag]=1
      @holes = Hole.where("outerflag=1").paginate(:page=>params[:page],:per_page=>10)
	else
      @holes = Hole.paginate(:page=>params[:page],:per_page=>10)
---
SELECT `holes`.* FROM `holes`

  def show
    @hole = Hole.find(params[:id])
---
SELECT `holes`.* FROM `holes` WHERE `holes`.`id` = 1 LIMIT 1

  def edit
    @hole = Hole.find(params[:id])
---
SELECT `holes`.* FROM `holes` WHERE `holes`.`id` = 3 LIMIT 1

  def create
    @hole = Hole.new(params[:hole])
    # 更改合同的状态, 如果合同为"待执行"，则修改为“执行中”
    contract = Contract.find(params[:hole][:contract_id])
    if (contract.status == 0)
      contract.status = 1
      contract.save
    end
    #默认钻孔的状态是 0， 为待执行
    @hole.status = 0
    #@hole.save_file(params[:attachment]) if params[:attachment]
    #logger.info "the attachment is #{params[:attachment]}"
    #logger.info "the hole info is #{@hole}"
    #logger.info "the contract id is #{params[:hole][:contract_id]}"
    #@hole.contract_id = params[:contract_id]
    respond_to do |format|
      if @hole.save
---
INSERT INTO `holes` (`created_at`, `deep`, `diameter`, `finishdate`, `startdate`, `updated_at`) VALUES ('2013-03-16 03:34:08', 15, 15, '2013-08-16', '2013-03-16', '2013-03-16 03:34:08')

  def update
    @hole = Hole.find(params[:id])
    if(params[:opennotice] || params[:closenotice])
      @hole.save_closefile(params[:opennotice].nil??nil:params[:opennotice][:data],params[:closenotice].nil??nil:params[:closenotice][:data],params[:curvetable].nil??nil:params[:curvetable][:data],params[:measuretable].nil??nil:params[:measuretable][:data],params[:coretransferdoc].nil??nil:params[:coretransferdoc][:data],params[:tourreporttransferdoc].nil??nil:params[:tourreporttransferdoc][:data],params[:qualitychecktable].nil??nil:params[:qualitychecktable][:data],params[:tourreporttable].nil??nil:params[:tourreporttable][:data])
---
SELECT `holes`.* FROM `holes` WHERE `holes`.`id` = 3 LIMIT 1
UPDATE `holes` SET `deep` = 20, `diameter` = 20, `updated_at` = '2013-03-18 05:44:29' WHERE `holes`.`id` = 3