app/controllers/materials_controller.rb

  def index
    @materials = Material.all
---
SELECT `materials`.* FROM `materials`

  def show
    @material = Material.find(params[:id])
---
SELECT `materials`.* FROM `materials` WHERE `materials`.`id` = 1 LIMIT 1

  def edit
    @material = Material.find(params[:id])
---
SELECT `materials`.* FROM `materials` WHERE `materials`.`id` = 1 LIMIT 1

  def create
    @material = Material.new(params[:material])

    respond_to do |format|
      if @material.save
---
INSERT INTO `materials` (`count`, `created_at`, `name`, `updated_at`) VALUES (10, '2013-03-11 05:54:56', '设备1', '2013-03-11 05:54:56')