app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT `teams`.* FROM `teams`

  def show
    @team = Team.find(params[:id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1

  def edit
    @team = Team.find(params[:id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO `teams` (`contact`, `created_at`, `leader`, `memberquantity`, `name`, `updated_at`) VALUES ('135124123', '2013-03-18 03:51:36', '朱哥', 10, '郑州勘探队', '2013-03-18 03:51:36')